#include "app_dps.h"
#include "board.h"
#include "stdlib.h"
#include "pwm.h"
#include "gpio.h"
#include "app_select.h"
#include "print.h"
#include "ty_beacon.h"
#include "app_ir.h"

#include "ty_rtc.h"
#include "ty_timing.h"
#include "ty_light_driver_bp5758d.h"

/// RED gamma 0.8 ~ 100%
//static uint8_t ucGammaRed[] = {
//						0,  0,  1,  1,  1,  2,  2,  3,  3,  4,  4,  5,  6,  6,  7,  7,  8,  9,  9,  10,
//						11, 11, 12, 13, 13, 14, 15, 15, 16, 17, 18, 18, 19, 20, 21, 21, 22, 23, 24, 24,
//						25, 26, 27, 28, 28, 29, 30, 31, 32, 32, 33, 34, 35, 36, 37, 37, 38, 39, 40, 41,
//						42, 43, 44, 44, 45, 46, 47, 48, 49, 50, 51, 52, 52, 53, 54, 55, 56, 57, 58, 59,
//						60, 61, 62, 63, 64, 65, 66, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78,
//						79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98,
//						99, 100,101,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,
//						121,122,123,124,125,126,127,128,129,130,131,132,134,135,136,137,138,139,140,141,
//						142,144,145,146,147,148,149,150,151,152,154,155,156,157,158,159,160,162,163,164,
//						165,166,167,168,170,171,172,173,174,175,177,178,179,180,181,182,184,185,186,187,
//						188,189,191,192,193,194,195,196,198,199,200,201,202,204,205,206,207,208,210,211,
//						212,213,214,216,217,218,219,220,222,223,224,225,227,228,229,230,231,233,234,235,
//						236,238,239,240,241,243,244,245,246,248,249,250,251,253,254,255
//};
//
///// GREEN gamma 0.6 ~ 70%
//static uint8_t ucGammaGreen[] = {
//						0,  0,  0,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,
//						3,  3,  3,  3,  3,  4,  4,  4,  4,  5,  5,  5,  6,  6,  6,  7,  7,  7,  7,  8,
//						8,  8,  9,  9, 10, 10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 16,
//						16, 16, 17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 23, 24, 24, 25, 25,
//						26, 26, 27, 27, 28, 29, 29, 30, 30, 31, 31, 32, 33, 33, 34, 34, 35, 36, 36, 37,
//						38, 38, 39, 39, 40, 41, 41, 42, 43, 43, 44, 45, 45, 46, 47, 47, 48, 49, 49, 50,
//						51, 52, 52, 53, 54, 54, 55, 56, 57, 57, 58, 59, 60, 60, 61, 62, 63, 63, 64, 65,
//						66, 66, 67, 68, 69, 70, 70, 71, 72, 73, 74, 75, 75, 76, 77, 78, 79, 80, 80, 81,
//						82, 83, 84, 85, 86, 86, 87, 88, 89, 90, 91, 92, 93, 94, 94, 95, 96, 97, 98, 99,
//						100,101,102,103,104,105,106,106,107,108,109,110,111,112,113,114,115,116,117,118,
//						119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,139,
//						140,141,142,143,144,145,146,147,148,149,150,151,152,154,155,156,157,158,159,160,
//						161,162,164,165,166,167,168,169,170,172,173,174,175,176,177,179
//};
//
////BLUE gama 0.6-75%
//static uint8_t ucGammaBlue[] = {
//						0,  0,  0,  0,  0,  0,  0,  0,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  3,
//						3,  3,  3,  3,  4,  4,  4,  5,  5,  5,  5,  6,  6,  6,  7,  7,  7,  8,  8,  8,
//						9,  9,  9, 10, 10, 11, 11, 11, 12, 12, 13, 13, 14, 14, 14, 15, 15, 16, 16, 17,
//						17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 23, 24, 24, 25, 25, 26, 27, 27,
//						28, 28, 29, 29, 30, 31, 31, 32, 32, 33, 34, 34, 35, 36, 36, 37, 38, 38, 39, 40,
//						40, 41, 42, 42, 43, 44, 44, 45, 46, 46, 47, 48, 49, 49, 50, 51, 51, 52, 53, 54,
//						54, 55, 56, 57, 58, 58, 59, 60, 61, 61, 62, 63, 64, 65, 65, 66, 67, 68, 69, 70,
//						70, 71, 72, 73, 74, 75, 76, 76, 77, 78, 79, 80, 81, 82, 83, 83, 84, 85, 86, 87,
//						88, 89, 90, 91, 92, 93, 94, 94, 95, 96, 97, 98, 99,100,101,102,103,104,105,106,
//						107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,127,
//						128,129,130,131,132,133,134,135,136,137,138,139,141,142,143,144,145,146,147,148,
//						150,151,152,153,154,155,156,158,159,160,161,162,163,165,166,167,168,169,170,172,
//						173,174,175,176,178,179,180,181,183,184,185,186,188,189,190,191
//};

static uint16_t seg_temperature[16] = {0,100,200,300,400,500,600,700,800,900,1000};
static uint16_t seg_brightness[16]  = {10,100,200,300,400,500,600,700,800,900,1000};

volatile static uint32_t power_outage_detect_flag;
volatile uint32_t gpio_level = 0;
#define SCENE_MODEL0	0
#define SCENE_NIGHT		0
#define SCENE_NEUTRAL	1
#define SCENE_COLDW		2
#define SCENE_WARMW		3

typedef enum {
	SCENE_WHITE = 0x00,
    SCENE_MODEL = 0x02,		
	SCENE_BLINK = 0x03,	
    SCENE_SEGLIGHT = 0x04,
	SCENE_REMIND = 0x05,        // 渐变模式
	SCENE_MAX = 0x06,
}DRIVER_SCENE_MODE_E;



#pragma pack (1)
typedef struct{//save[56:8]
	uint8_t seg_onoff;//1
	uint8_t scene_mode;//0
	uint8_t seg_nums;//0
	uint8_t sence_model;
	int16_t seg_B1;//1000
	int16_t seg_B2;//1000
	int16_t seg_B3;//1000
	int16_t seg_B4;//1000
	int16_t seg_B5;//1000
	int16_t seg_T1;//1000
	int16_t seg_T2;//1000
	int16_t seg_T3;//1000
	int16_t seg_T4;//1000
	int16_t seg_T5;//1000
	int16_t B;//0
	int16_t T;//1000
	uint8_t cnt;
	uint8_t ac_cnt;
	uint8_t data_right_flag;
}light_value_s;


typedef struct 
{
    u16 usCold;       ///< C value,rang from 0 to 1000
    u16 usWarm;       ///< W value,rang from 0 to 1000
}PWM_LIGHT_CONTRL_T;
typedef struct 
{
	bool bFirstChange;
	//uint8_t ucSceneUnit;
    //uint8_t ucUnitCnt;
	uint8_t uiGainTemp;
    PWM_LIGHT_CONTRL_T tTargetVal;
	PWM_LIGHT_CONTRL_T tCurrVal;
}LIGHT_CTRL_HANDLE_T;

bool light_ctrl_amplify_flag = 1;
#pragma pack () 

light_value_s light_value;
LIGHT_CTRL_HANDLE_T light_ctrl_data;

bool bSceneSetFirstFlag = TRUE;
//bool bSceneStopFlag = FALSE;

volatile bool light_value_onoff = 1;
bool light_shade_flag;


uint32_t countdown = 0;//s 1day=86400
uint8_t countdown_target_onoff = 0;
uint8_t breathe_scene_flag = 0;
u16 light_time_setok_flag = 0;
u32 store_T = 0;
bool store_flag = 0;

#define RESET_MAX_CNT (light_value.seg_onoff > 0 ? 12 : 5)

void app_dps_write_to_storage();
static void light_ctrl_shade_start(u8 step);

